Terraform plan for __dev__
<details>
  <summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_limit_range.cluster_limit["inventory"] will be created
  + resource "kubernetes_limit_range" "cluster_limit" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "default-limit"
          + namespace        = "inventory"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + limit {
              + default         = {
                  + "memory" = "1G"
                }
              + default_request = {
                  + "cpu"    = "500m"
                  + "memory" = "1G"
                }
              + type            = "Container"
            }
        }
    }

  # kubernetes_namespace.gke_namespace["inventory"] will be created
  + resource "kubernetes_namespace" "gke_namespace" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "inventory"
            }
          + generation       = (known after apply)
          + name             = "inventory"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 4, in module "jumpbox":
   4:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #38](https://github.com/ebomart/commerce-infrastructure/actions/runs/1158657946)